#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
tls_private_key.bastion-key: Refreshing state... [id=f005fc66faabd724c33d4306fdb071ee159703b7]
aws_key_pair.generated-key: Refreshing state... [id=terraform-20220605115041195400000001]
aws_vpc.vpc-terraform-homework-1: Refreshing state... [id=vpc-0376e1c478660b7bb]
aws_ecs_cluster.ecsc-terraform-homework-1: Refreshing state... [id=arn:aws:ecs:us-east-1:762135247538:cluster/ecsc-terraform-homework-1]
aws_subnet.subnet-public-a-terraform-homework-1: Refreshing state... [id=subnet-025e34eb4cba2f49f]
aws_internet_gateway.igw-terraform-homework-1: Refreshing state... [id=igw-0918d55b53b7ff673]
aws_route_table.rt-private-terraform-homework-1: Refreshing state... [id=rtb-015181a4303943eff]
aws_subnet.subnet-private-a-terraform-homework-1: Refreshing state... [id=subnet-0f259964b5a6b6cf3]
aws_subnet.subnet-public-b-terraform-homework-1: Refreshing state... [id=subnet-097b3acdd0c13d46a]
aws_security_group.ecs-sec-gr-terraform-homework-1: Refreshing state... [id=sg-0b48c91fa481bd3da]
aws_security_group.sec-gr-public-terraform-homework-1: Refreshing state... [id=sg-0aa88d05104d8d317]
aws_subnet.subnet-private-b-terraform-homework-1: Refreshing state... [id=subnet-05cba37e595ce2f8f]
aws_route_table.rt-public-terraform-homework-1: Refreshing state... [id=rtb-0c23362b4739162dc]
aws_security_group.rds-sec-gr-terraform-homework-1: Refreshing state... [id=sg-0e8b69dfe37882edb]
aws_route_table_association.rta-private-a-terraform-homework-1: Refreshing state... [id=rtbassoc-0096ebc9666490ef5]
aws_route_table_association.rta-private-b-terraform-homework-1: Refreshing state... [id=rtbassoc-000ae941c7e7a3456]
aws_route_table_association.rta-public-b-terraform-homework-1: Refreshing state... [id=rtbassoc-0fd0afd61a143e502]
aws_route_table_association.rta-public-a-terraform-homework-1: Refreshing state... [id=rtbassoc-01abb022e8757ad75]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_db_instance.rds-terraform-homework-1 will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_db_instance" "rds-terraform-homework-1" {
      + address                         = (known after apply)
      + allocated_storage               = (known after apply)
      + auto_minor_version_upgrade      = (known after apply)
      + availability_zone               = (known after apply)
      + backup_retention_period         = (known after apply)
      + ca_cert_identifier              = (known after apply)
      + db_cluster_identifier           = (known after apply)
      + db_instance_arn                 = (known after apply)
      + db_instance_class               = (known after apply)
      + db_instance_identifier          = "postgres"
      + db_instance_port                = (known after apply)
      + db_name                         = (known after apply)
      + db_parameter_groups             = (known after apply)
      + db_security_groups              = (known after apply)
      + db_subnet_group                 = (known after apply)
      + enabled_cloudwatch_logs_exports = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = (known after apply)
      + engine_version                  = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + iops                            = (known after apply)
      + kms_key_id                      = (known after apply)
      + license_model                   = (known after apply)
      + master_username                 = (known after apply)
      + monitoring_interval             = (known after apply)
      + monitoring_role_arn             = (known after apply)
      + multi_az                        = (known after apply)
      + option_group_memberships        = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = (known after apply)
      + publicly_accessible             = (known after apply)
      + replicate_source_db             = (known after apply)
      + resource_id                     = (known after apply)
      + storage_encrypted               = (known after apply)
      + storage_type                    = (known after apply)
      + tags                            = (known after apply)
      + timezone                        = (known after apply)
      + vpc_security_groups             = (known after apply)
    }

  # aws_db_instance.rds-terraform-homework-1 will be created
  + resource "aws_db_instance" "rds-terraform-homework-1" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_subnet_group_name                  = "rds-sub-gr-terraform-homework-1"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "13.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "postgres"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = "postgres"
      + nchar_character_set_name              = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-0e8b69dfe37882edb",
        ]
    }

  # aws_db_subnet_group.rds-sub-gr-terraform-homework-1 will be created
  + resource "aws_db_subnet_group" "rds-sub-gr-terraform-homework-1" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "rds-sub-gr-terraform-homework-1"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-05cba37e595ce2f8f",
          + "subnet-0f259964b5a6b6cf3",
        ]
      + tags_all    = (known after apply)
    }

  # aws_ecs_service.ecs-svc-terraform-homework-1 will be created
  + resource "aws_ecs_service" "ecs-svc-terraform-homework-1" {
      + cluster                            = "arn:aws:ecs:us-east-1:762135247538:cluster/ecsc-terraform-homework-1"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "terraform-homework-1"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = [
              + "sg-0aa88d05104d8d317",
              + "sg-0b48c91fa481bd3da",
              + "sg-0e8b69dfe37882edb",
            ]
          + subnets          = [
              + "subnet-025e34eb4cba2f49f",
              + "subnet-097b3acdd0c13d46a",
            ]
        }
    }

  # aws_ecs_task_definition.ecstd-terraform-homework-1 will be created
  + resource "aws_ecs_task_definition" "ecstd-terraform-homework-1" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = (known after apply)
      + family                   = "ecs-task-def-terraform-homework-1"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # aws_iam_role.ecs-task-ex-r-terraform-homework-1 will be created
  + resource "aws_iam_role" "ecs-task-ex-r-terraform-homework-1" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-task-ex-r-terraform-homework-1"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ecs-rp-attach-terraform-homework-1 will be created
  + resource "aws_iam_role_policy_attachment" "ecs-rp-attach-terraform-homework-1" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "ecs-task-ex-r-terraform-homework-1"
    }

  # aws_instance.bastion will be created
  + resource "aws_instance" "bastion" {
      + ami                                  = "ami-0022f774911c1d690"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-20220605115041195400000001"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = "subnet-025e34eb4cba2f49f"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = [
          + "sg-0aa88d05104d8d317",
          + "sg-0e8b69dfe37882edb",
        ]

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rdb = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @likvipavel, Action: `pull_request`*